src/getMeteringPoint.xml

<s:Envelope 
    xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
    <s:Header>
        <h:CredentialsHeader 
            xmlns:h="http://www.nubix.no/CredentialsHeader" 
            xmlns="http://www.nubix.no/CredentialsHeader" 
            xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
            xmlns:xsd="http://www.w3.org/2001/XMLSchema">
            <Username xmlns="">{{userName}}</Username>
            <Password xmlns="">{{password}}</Password>
        </h:CredentialsHeader>
    </s:Header>
    <s:Body 
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
        xmlns:xsd="http://www.w3.org/2001/XMLSchema">
        <GetMeteringPointIdRequest 
            xmlns="http://www.nubix.no/MeteringPointMethods">
            <request>
                <RequestId xmlns="">{{requestId}}</RequestId>
                <Requestor xmlns=""><GLN>{{gln}}</GLN></Requestor>
                {{#company}}
                <CommercialCustomer 
                    xmlns="">
                    {{#name}}<Name>{{../name}}</Name>{{/name}}
                    {{#orgNo}}<OrgNo>{{../orgNo}}</OrgNo>{{/orgNo}}
                    {{#meterNo}}<MeterNumber>{{../meterNo}}</MeterNumber>{{/meterNo}}
                    <Address>
                        {{#if address.address}}<Address1>{{address.address}}</Address1>{{/if}}
                        <PostCode>{{address.postalCode}}</PostCode>
                        {{#if address.city}}<Location>{{address.city}}</Location>{{/if}}
                        <CountryCode>NO</CountryCode>
                    </Address>
                </CommercialCustomer>
                {{/company}}
                {{#person}}
                <DomesticCustomer 
                    xmlns="">
                    {{#lastName}}<LastName>{{../lastName}}</LastName>{{/lastName}}
                    {{#firstName}}<FirstName>{{../firstName}}</FirstName>{{/firstName}}
                    {{#birthDate}}<BirthDate>{{../birthDate}}</BirthDate>{{/birthDate}}
                    
                    <Address>
                        {{#if address.address}}<Address1>{{address.address}}</Address1>{{/if}}
                        <PostCode>{{address.postalCode}}</PostCode>
                        {{#if address.city}}<Location>{{address.city}}</Location>{{/if}}
                        <CountryCode>NO</CountryCode>
                    </Address>
                    
                </DomesticCustomer>
                {{/person}}
            </request>
        </GetMeteringPointIdRequest>
    </s:Body>
</s:Envelope>